When I'm trying to re-apply resource I get this error
```bash
✗  terragrunt apply                                          
21:39:04.357 STDOUT terraform: netbird_token.this["access-api-365"]: Refreshing state... [id=d147ctrl0ubs73f1ibmg]
21:39:04.646 STDOUT terraform: Terraform used the selected providers to generate the following execution
21:39:04.646 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
21:39:04.646 STDOUT terraform: -/+ destroy and then create replacement
21:39:04.646 STDOUT terraform: Terraform will perform the following actions:
21:39:04.646 STDOUT terraform:   # netbird_token.this["access-api-365"] is tainted, so must be replaced
21:39:04.646 STDOUT terraform: -/+ resource "netbird_token" "this" {
21:39:04.646 STDOUT terraform:       ~ created_at      = "2025-06-10T18:16:23Z" -> (known after apply)
21:39:04.646 STDOUT terraform:       ~ expiration_date = "2026-06-10T18:16:23Z" -> (known after apply)
21:39:04.646 STDOUT terraform:       + id              = (known after apply)
21:39:04.646 STDOUT terraform:       + last_used       = (known after apply)
21:39:04.646 STDOUT terraform:         name            = "access-api-365"
21:39:04.646 STDOUT terraform:       ~ token           = (sensitive value)
21:39:04.646 STDOUT terraform:       ~ user_id         = "b022e5e-4fmh-55d7-86d8-123das21dsad" -> "9833c123-ab65-4e33-839f-dsadasasdsa2"
21:39:04.646 STDOUT terraform:         # (1 unchanged attribute hidden)
21:39:04.646 STDOUT terraform:     }
21:39:04.646 STDOUT terraform: Plan: 1 to add, 0 to change, 1 to destroy.
21:39:04.646 STDOUT terraform: 
21:39:04.646 STDOUT terraform: Changes to Outputs:
21:39:04.646 STDOUT terraform:   + tokens_ids    = {
21:39:04.646 STDOUT terraform:       + access-api-365 = (known after apply)
21:39:04.647 STDOUT terraform:     }
21:39:04.647 STDOUT terraform:   + tokens_values = (sensitive value)
21:39:04.647 STDOUT terraform: 
21:39:04.647 STDOUT terraform: Do you want to perform these actions?
21:39:04.647 STDOUT terraform:   Terraform will perform the actions described above.
21:39:04.647 STDOUT terraform:   Only 'yes' will be accepted to approve.
21:39:04.647 STDOUT terraform:   Enter a value: 
yes   
21:42:01.833 STDOUT terraform: netbird_token.this["access-api-365"]: Destroying... [name=access-api-365]
21:42:02.160 STDERR terraform: ╷
21:42:02.160 STDERR terraform: │ Error: Request cancelled
21:42:02.160 STDERR terraform: │ 
21:42:02.160 STDERR terraform: │ The plugin6.(*GRPCProvider).ApplyResourceChange request was cancelled.
21:42:02.160 STDERR terraform: ╵
21:42:02.160 STDERR terraform: Stack trace from the terraform-provider-netbird_v0.0.2 plugin:
21:42:02.160 STDERR terraform: panic: runtime error: invalid memory address or nil pointer dereference
21:42:02.160 STDERR terraform: [signal SIGSEGV: segmentation violation code=0x2 addr=0x40 pc=0x1014fa5f8]
21:42:02.161 STDERR terraform: goroutine 5 [running]:
21:42:02.161 STDERR terraform: github.com/netbirdio/netbird/management/client/rest.(*TokensAPI).Delete(0x14000147ca8?, {0x1018753d8, 0x140002a3530}, {0x14000136510?, 0x10187ccb8?}, {0x0?, 0x1018753d8?})
21:42:02.161 STDERR terraform:  github.com/netbirdio/netbird@v0.44.0/management/client/rest/tokens.go:69 +0x98
21:42:02.161 STDERR terraform: github.com/netbirdio/terraform-provider-netbird/internal/provider.(*Token).Delete(0x1400013e250, {0x1018753d8, 0x140002a3530}, {{{{0x10187a470, 0x1400019fd70}, {0x10174efe0, 0x1400019fb00}}, {0x10187ccb8, 0x140001e0d70}}, {{{0x0, ...}, ...}, ...}, ...}, ...)
21:42:02.161 STDERR terraform:  github.com/netbirdio/terraform-provider-netbird/internal/provider/token_resource.go:229 +0x19c
21:42:02.161 STDERR terraform: github.com/hashicorp/terraform-plugin-framework/internal/fwserver.(*Server).DeleteResource(0x1400016ab48, {0x1018753d8, 0x140002a3530}, 0x14000445488, 0x14000445460)
21:42:02.161 STDERR terraform:  github.com/hashicorp/terraform-plugin-framework@v1.14.1/internal/fwserver/server_deleteresource.go:100 +0x4f8
21:42:02.161 STDERR terraform: github.com/hashicorp/terraform-plugin-framework/internal/fwserver.(*Server).ApplyResourceChange(0x1400016ab48, {0x1018753d8, 0x140002a3530}, 0x14000147360, 0x140004455e0)
21:42:02.161 STDERR terraform:  github.com/hashicorp/terraform-plugin-framework@v1.14.1/internal/fwserver/server_applyresourcechange.go:79 +0x248
21:42:02.161 STDERR terraform: github.com/hashicorp/terraform-plugin-framework/internal/proto6server.(*Server).ApplyResourceChange(0x1400016ab48, {0x1018753d8?, 0x140002a3440?}, 0x140001472c0)
21:42:02.162 STDERR terraform:  github.com/hashicorp/terraform-plugin-framework@v1.14.1/internal/proto6server/server_applyresourcechange.go:55 +0x2e0
21:42:02.162 STDERR terraform: github.com/hashicorp/terraform-plugin-go/tfprotov6/tf6server.(*server).ApplyResourceChange(0x14000123680, {0x1018753d8?, 0x140002a29f0?}, 0x14000142c40)
21:42:02.162 STDERR terraform:  github.com/hashicorp/terraform-plugin-go@v0.26.0/tfprotov6/tf6server/server.go:866 +0x2a8
21:42:02.162 STDERR terraform: github.com/hashicorp/terraform-plugin-go/tfprotov6/internal/tfplugin6._Provider_ApplyResourceChange_Handler({0x101849da0, 0x14000123680}, {0x1018753d8, 0x140002a29f0}, 0x14000141080, 0x0)
21:42:02.162 STDERR terraform:  github.com/hashicorp/terraform-plugin-go@v0.26.0/tfprotov6/internal/tfplugin6/tfplugin6_grpc.pb.go:611 +0x1c0
21:42:02.162 STDERR terraform: google.golang.org/grpc.(*Server).processUnaryRPC(0x14000154200, {0x1018753d8, 0x140002a2990}, 0x14000512960, 0x140003dca80, 0x101de9238, 0x0)
21:42:02.162 STDERR terraform:  google.golang.org/grpc@v1.69.4/server.go:1392 +0xc44
21:42:02.162 STDERR terraform: google.golang.org/grpc.(*Server).handleStream(0x14000154200, {0x101875c38, 0x1400047e000}, 0x14000512960)
21:42:02.162 STDERR terraform:  google.golang.org/grpc@v1.69.4/server.go:1802 +0x910
21:42:02.162 STDERR terraform: google.golang.org/grpc.(*Server).serveStreams.func2.1()
21:42:02.162 STDERR terraform:  google.golang.org/grpc@v1.69.4/server.go:1030 +0x84
21:42:02.162 STDERR terraform: created by google.golang.org/grpc.(*Server).serveStreams.func2 in goroutine 55
21:42:02.162 STDERR terraform:  google.golang.org/grpc@v1.69.4/server.go:1041 +0x13c
21:42:02.162 STDERR terraform: Error: The terraform-provider-netbird_v0.0.2 plugin crashed!
21:42:02.162 STDERR terraform: This is always indicative of a bug within the plugin. It would be immensely
21:42:02.162 STDERR terraform: helpful if you could report the crash with the plugin's maintainers so that it
21:42:02.162 STDERR terraform: can be fixed. The output above should help diagnose the issue.
21:42:02.168 ERROR  terraform invocation failed in ./.terragrunt-cache/nivT31LIvPKVea3oiRJQmslnwSY/nKEdFHUWvFdi7bCeqeLPqnH5Zsw
21:42:02.168 ERROR  error occurred:

* Failed to execute "terraform apply" in ./.terragrunt-cache/nivT31LIvPKVea3oiRJQmslnwSY/nKEdFHUWvFdi7bCeqeLPqnH5Zsw
  ╷
  │ Error: Request cancelled
  │ 
  │ The plugin6.(*GRPCProvider).ApplyResourceChange request was cancelled.
  ╵
  
  Stack trace from the terraform-provider-netbird_v0.0.2 plugin:
  
  panic: runtime error: invalid memory address or nil pointer dereference
  [signal SIGSEGV: segmentation violation code=0x2 addr=0x40 pc=0x1014fa5f8]
  
  goroutine 5 [running]:
  github.com/netbirdio/netbird/management/client/rest.(*TokensAPI).Delete(0x14000147ca8?, {0x1018753d8, 0x140002a3530}, {0x14000136510?, 0x10187ccb8?}, {0x0?, 0x1018753d8?})
        github.com/netbirdio/netbird@v0.44.0/management/client/rest/tokens.go:69 +0x98
  github.com/netbirdio/terraform-provider-netbird/internal/provider.(*Token).Delete(0x1400013e250, {0x1018753d8, 0x140002a3530}, {{{{0x10187a470, 0x1400019fd70}, {0x10174efe0, 0x1400019fb00}}, {0x10187ccb8, 0x140001e0d70}}, {{{0x0, ...}, ...}, ...}, ...}, ...)
        github.com/netbirdio/terraform-provider-netbird/internal/provider/token_resource.go:229 +0x19c
  github.com/hashicorp/terraform-plugin-framework/internal/fwserver.(*Server).DeleteResource(0x1400016ab48, {0x1018753d8, 0x140002a3530}, 0x14000445488, 0x14000445460)
        github.com/hashicorp/terraform-plugin-framework@v1.14.1/internal/fwserver/server_deleteresource.go:100 +0x4f8
  github.com/hashicorp/terraform-plugin-framework/internal/fwserver.(*Server).ApplyResourceChange(0x1400016ab48, {0x1018753d8, 0x140002a3530}, 0x14000147360, 0x140004455e0)
        github.com/hashicorp/terraform-plugin-framework@v1.14.1/internal/fwserver/server_applyresourcechange.go:79 +0x248
  github.com/hashicorp/terraform-plugin-framework/internal/proto6server.(*Server).ApplyResourceChange(0x1400016ab48, {0x1018753d8?, 0x140002a3440?}, 0x140001472c0)
        github.com/hashicorp/terraform-plugin-framework@v1.14.1/internal/proto6server/server_applyresourcechange.go:55 +0x2e0
  github.com/hashicorp/terraform-plugin-go/tfprotov6/tf6server.(*server).ApplyResourceChange(0x14000123680, {0x1018753d8?, 0x140002a29f0?}, 0x14000142c40)
        github.com/hashicorp/terraform-plugin-go@v0.26.0/tfprotov6/tf6server/server.go:866 +0x2a8
  github.com/hashicorp/terraform-plugin-go/tfprotov6/internal/tfplugin6._Provider_ApplyResourceChange_Handler({0x101849da0, 0x14000123680}, {0x1018753d8, 0x140002a29f0}, 0x14000141080, 0x0)
        github.com/hashicorp/terraform-plugin-go@v0.26.0/tfprotov6/internal/tfplugin6/tfplugin6_grpc.pb.go:611 +0x1c0
  google.golang.org/grpc.(*Server).processUnaryRPC(0x14000154200, {0x1018753d8, 0x140002a2990}, 0x14000512960, 0x140003dca80, 0x101de9238, 0x0)
        google.golang.org/grpc@v1.69.4/server.go:1392 +0xc44
  google.golang.org/grpc.(*Server).handleStream(0x14000154200, {0x101875c38, 0x1400047e000}, 0x14000512960)
        google.golang.org/grpc@v1.69.4/server.go:1802 +0x910
  google.golang.org/grpc.(*Server).serveStreams.func2.1()
        google.golang.org/grpc@v1.69.4/server.go:1030 +0x84
  created by google.golang.org/grpc.(*Server).serveStreams.func2 in goroutine 55
        google.golang.org/grpc@v1.69.4/server.go:1041 +0x13c
  
  Error: The terraform-provider-netbird_v0.0.2 plugin crashed!
  
  This is always indicative of a bug within the plugin. It would be immensely
  helpful if you could report the crash with the plugin's maintainers so that it
  can be fixed. The output above should help diagnose the issue.
  
  
```